КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул3_5_02/КонтурЛогистика_ПЛ_Титул3_5_02.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЛ_Титул3_5_02</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Титул1</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфВыпуск</name>
    <comment>Дата формирования файла обмена информации о прохождении предрейсового или предсменного контроля технического состояния транспортного средства, о показаниях одометра при выпуске транспортного средства на линию</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфВыпуск</name>
    <comment>Время формирования файла обмена информации о прохождении предрейсового или предсменного контроля технического состояния транспортного средства, о показаниях одометра при выпуске транспортного средства на линию</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфСоб</name>
    <comment>Дата формирования файла обмена Т1</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфСоб</name>
    <comment>Время формирования файла обмена Т1</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфСоб</name>
    <comment>Идентификатор файла обмена Т1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПСоб</name>
    <comment>Электронная подпись файла обмена информации об обстоятельствах и особенностях рейса</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрКонтТехСост</name>
    <comment>Дата и время контроля технического состояния</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрВыпНаЛин</name>
    <comment>Дата и время выпуска транспортного средства на линию</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТехРаботник</name>
    <comment>Сведения о должностном лице, ответственном за техническое состояние и безопасную эксплуатацию транспортного средства</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодпис</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ДтВрНачРабГрф</name>
    <comment>Дата и время начала работы транспортного средства по графику</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДтВрКонРабГрф</name>
    <comment>Дата и время окончания работы транспортного средства по графику</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоказанияОдометра</name>
    <comment>Показания одометра</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДопСведенияОПодписанте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОстаткиТоплива</name>
    <comment>Сведения об остатке топлива при выезде на линию</comment>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Топливо</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ГорючеСмазочныеМатериалы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоТоплива</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасовРаботыСВключеннымОтопителем</name>
      <comment>Количество часов работы транспортного средства с включенным отопителем</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоЧасовРаботыОборудования</name>
      <comment>Количество часов работы оборудования специального транспортного средства</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>T(1-2000)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПолОстаткиТоплива</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдентификаторСтрокиОстатковТоплива</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>T(1-2000)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/InformationRegisters/КонтурЛогистика_СтатусыТитулов/КонтурЛогистика_СтатусыТитулов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтурЛогистика_СтатусыТитулов</name>
  <comment>Время по МСК!</comment>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыТитулов</types>
    </type>
  </resources>
  <resources>
    <name>СтатусПодписи</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СтатусыПодписи</types>
    </type>
  </resources>
  <resources>
    <name>ТипОшибки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыОшибокСтатусаТитула</types>
    </type>
  </resources>
  <resources>
    <name>КодОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОписаниеОшибки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>КоличествоОшибок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Пользователь1С</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодробноеОписаниеОшибки</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГП</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_ЗаявкаНаМаршрут</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2_5_02</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулГО</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ДФ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЭкспедиторскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул7</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул4_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ПЭ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул6</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул5</types>
      <types>DocumentRef.КонтурЛогистика_ЗЗ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул8</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул3</types>
      <types>DocumentRef.КонтурЛогистика_ЗН_Титул4</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул3_5_02</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1</types>
      <types>DocumentRef.КонтурЛогистика_ТрН_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СкладскаяРасписка</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул2</types>
      <types>DocumentRef.КонтурЛогистика_СВ_ТитулПВ</types>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул6</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул3_5_02/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Удалим пустые строки из ОстаткиТоплива
	УдалитьПустыеСтрокиИзТаблицТоплива();
	
	// Подключаемый модуль (ПМ)
	ПараметрыПМ = Новый Структура("ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения", ЭтотОбъект, Отказ, РежимЗаписи, РежимПроведения);
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля("ПЛ_Титул3_5_02_ПередЗаписью_После", Истина, ПараметрыПМ);
	Отказ = ?(Отказ <> ПараметрыПМ.Отказ, ПараметрыПМ.Отказ, Отказ);	// Если признак отказа был изменен в ПМ, то пробрасываем его значение
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьЧерновикДляНовогоДокумента(Ссылка);
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ДанныеЗаполнения <> Неопределено 
		И ТипЗнч(ДанныеЗаполнения) = Тип("Структура") 
		И ДанныеЗаполнения.Свойство("ПредыдущийТитул")
		И ЗначениеЗаполнено(ДанныеЗаполнения.ПредыдущийТитул) Тогда
		
		ЗаполнитьПоПредыдущемуТитулу(ДанныеЗаполнения);
		ЗаполнитьРеквизитыПоПользователю();
		КонтурЛогистика_ОбработкаДокументовСервер.ДополнитьДополнительныхПолучателейИзГлавногоДокумента(ЭтотОбъект, Титул1);
		
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.КонтурЛогистика_ФайлыОбмена") Тогда
		
		ФайлСсылка = ДанныеЗаполнения;
		ТекстФайла = ФайлСсылка.ТекстXML.Получить();
		Если СокрЛП(ТекстФайла) = "" Тогда 
			Сообщить("По файлу " + ФайлСсылка + " нет текста титула");
			Возврат;
		КонецЕсли;
		
		ЗаполнитьИзФайлаОбмена(ТекстФайла, ФайлСсылка);
		
	КонецЕсли;
	
	// ПМ на изменение документа
	КонтурЛогистика_ПодключаемыйМодульВызов.ОбработкаСобытияПодключаемогоМодуля(
		"ПЛ_Титул3_5_02_ОбработкаЗаполнения_После",
		Истина,
		ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ЗаполнитьИзФайлаОбмена

Процедура ЗаполнитьИзФайлаОбмена(Знач ТекстФайла, Знач ФайлСсылка)
	
	НайденныйДокументТ1 = КонтурЛогистика_ОбработкаДокументовСервер.НайтиГлавныйДокументПоФайлуПЛ(ФайлСсылка);
	
	Если Не ЗначениеЗаполнено(НайденныйДокументТ1) Тогда 
		
		Сообщить("При создании титула по файлу " + ФайлСсылка + "не смог найти исходный документ Титул1 путевого листа, создание не выполнено");
		
	Иначе
		
		Титул1 = НайденныйДокументТ1;
		XDTO = КонтурЛогистика_КонструкторыXDTO.ПолучитьXDTOпоXML(ТекстФайла);
		
		ЗаполнитьРеквизитыТитулаИзXDTO(XDTO);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьРеквизитыТитулаИзXDTO(Знач XDTO)
	
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Документ = КС.XDTO_Вычислить(XDTO, "Документ");
	СодИнфВыпуск = КС.XDTO_Вычислить(XDTO, "Документ.СодИнфВыпуск");
	
	ДатИнфВыпуск 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ДатИнфВыпуск"));
	ВрИнфВыпуск 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ВрИнфВыпуск"));
		
	ДатФайлИнфСоб 	= КС.Конвертировать_ДатаТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфСоб.ДатФайлИнфСоб"));
	ВрФайлИнфСоб 	= КС.Конвертировать_ВремяТип_вДата(КС.XDTO_Вычислить(Документ, "ИдИнфСоб.ВрФайлИнфСоб"));
	ИдФайлИнфСоб 	= КС.XDTO_Вычислить(Документ, "ИдИнфСоб.ИдФайлИнфСоб");
	ЭПСоб 			= КС.XDTO_Вычислить(Документ, "ИдИнфСоб.ЭП");
	
	ДатВрКонтТехСост_raw = КС.XDTO_Вычислить(СодИнфВыпуск, "ДатВрКонтТехСост");
	ДатВрКонтТехСост = КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДатВрКонтТехСост_raw);
	
	ДатВрВыпНаЛин_raw = КС.XDTO_Вычислить(СодИнфВыпуск, "ДатВрВыпНаЛин");
	ДатВрВыпНаЛин = КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДатВрВыпНаЛин_raw);
	
	ОтметКонтТехСост = КС.XDTO_Вычислить(СодИнфВыпуск, "СвКонтТехСост");
	Если ОтметКонтТехСост = "2" Тогда	// выпуск на линию не разрешен
		ЕстьОтказВПодписи = Истина;
	КонецЕсли;
		
	ТипПодпис_raw = КС.XDTO_Вычислить(Документ, "ПодпИнфВыпуск.ТипПодпис");
	ТипПодпис = Перечисления.КонтурЛогистика_ТипыПодписи.ЗначениеИзXDTO(ТипПодпис_raw);
	
	Фамилия = КС.XDTO_Вычислить(Документ, "ПодпИнфВыпуск.ФИО.Фамилия");
	Имя = КС.XDTO_Вычислить(Документ, "ПодпИнфВыпуск.ФИО.Имя");
	Отчество = КС.XDTO_Вычислить(Документ, "ПодпИнфВыпуск.ФИО.Отчество");
	
	ДопСведенияОПодписанте = КС.XDTO_Вычислить(Документ, "ПодпИнфВыпуск.ДопСведПодп");
	
	СвОтвЛиц_XDTO = КС.XDTO_Вычислить(СодИнфВыпуск, "СвОтвЛиц");
	Если СвОтвЛиц_XDTO <> Неопределено Тогда
		ТехРаботник = КС.Конвертировать_СведОтвЛицоТип_вСотрудникаЛогистика(СвОтвЛиц_XDTO);
	КонецЕсли;
	
	СвТСВыпуск = КС.XDTO_Вычислить(СодИнфВыпуск, "СвТСВыпуск");
	
	Если СвТСВыпуск <> Неопределено Тогда
	
		ДтВрНачРабГрф_raw = КС.XDTO_Вычислить(СвТСВыпуск, "ДтВрНачРабГрф");
		ДтВрНачРабГрф = КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДтВрНачРабГрф_raw);
		
		ДтВрКонРабГрф_raw = КС.XDTO_Вычислить(СвТСВыпуск, "ДтВрКонРабГрф");
		ДтВрКонРабГрф = КС.Конвертировать_ДатаВремяВЗТип_вДатаВремяСеанса(ДтВрКонРабГрф_raw);
		
		ПоказанияОдометра = КС.XDTO_Вычислить(СвТСВыпуск, "ОдомВыпуск");
		
		// Остатки топлива
		КС.Конвертировать_ТоплТип_вТЧТопливоЛогистика(СвТСВыпуск, "СвТоплВыезд", ЭтотОбъект, "ОстаткиТоплива");
				
		// ИнфПол
		КС.ЗаполнитьИнфПолИзXDTOсИдФайл(СвТСВыпуск, ЭтотОбъект, "ИнфПол");
		
	КонецЕсли;
		
	КС.ЗаполнитьДополнительныхПолучателей(XDTO, ЭтотОбъект);
		
КонецПроцедуры

#КонецОбласти

#Область ЗаполнитьПоПредыдущемуТитулу

Процедура ЗаполнитьПоПредыдущемуТитулу(Знач ДанныеЗаполнения)
	
	ПредыдущийТитул = ДанныеЗаполнения.ПредыдущийТитул;
	
	Если ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1_5_02") Тогда 
		Титул1 	= ПредыдущийТитул;
	Иначе
		Титул1 	= ПредыдущийТитул.Титул1;
	КонецЕсли;
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02);
	
	// поиск документа учетной системы
	Если ЗначениеЗаполнено(КонтекстНастройкиКонвертации.ТипДокумента1С) Тогда
		
		НайденныйДокУчСист = КонтурЛогистика_ОбработкаДокументовСервер.НайтиДокументУчетнойСистемыПоТипуЛогистика(
			Титул1, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02);
		
		Если ЗначениеЗаполнено(НайденныйДокУчСист) Тогда
			ДокументОснование = НайденныйДокУчСист;
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатВрКонтТехСост) Тогда
		ДатВрКонтТехСост = ТекущаяДатаСеанса();
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ДатВрВыпНаЛин) Тогда
		ДатВрВыпНаЛин = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если ДанныеЗаполнения.Свойство("ПроверкаЗаполнения") Тогда
		ЭПСоб = "<для проверки заполнения>";
	Иначе
		ЗаполнитьУказателиНаПредыдущийТитул(ПредыдущийТитул);
	КонецЕсли;
	
	ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации);
	
	// Данные из рабочего места
	Если ДанныеЗаполнения.Свойство("ТехРаботник") И ЗначениеЗаполнено(ДанныеЗаполнения.ТехРаботник) Тогда
		ТехРаботник = ДанныеЗаполнения.ТехРаботник;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("Должность") И ЗначениеЗаполнено(ДанныеЗаполнения.Должность) Тогда
		Должность = ДанныеЗаполнения.Должность;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ДатВрКонтТехСост") И ЗначениеЗаполнено(ДанныеЗаполнения.ДатВрКонтТехСост) Тогда
		ДатВрКонтТехСост = ДанныеЗаполнения.ДатВрКонтТехСост;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ДатВрВыпНаЛин") И ЗначениеЗаполнено(ДанныеЗаполнения.ДатВрВыпНаЛин) Тогда
		ДатВрВыпНаЛин = ДанныеЗаполнения.ДатВрВыпНаЛин;
	КонецЕсли;
	Если ДанныеЗаполнения.Свойство("ПоказанияОдометра") И ЗначениеЗаполнено(ДанныеЗаполнения.ПоказанияОдометра) Тогда
		ПоказанияОдометра = ДанныеЗаполнения.ПоказанияОдометра;
	КонецЕсли;
	
	// Данные сквозного сценария (из титула 1)
	Если Титул1.ФормироватьТ3Сразу Тогда
		ТехРаботник = Титул1.ДанныеТ3ТехРаботник;
		Должность = Титул1.ДанныеТ3Должность;
		ДатВрКонтТехСост = Титул1.ДанныеТ3ДатВрКонтТехСост;
		ДатВрВыпНаЛин = Титул1.ДанныеТ3ДатВрВыпНаЛин;
		ПоказанияОдометра = Титул1.ДанныеТ3ПоказанияОдометра;
		ПользовательПодписант = Титул1.ДанныеТ3ПользовательПодписант;
		ПараметрНастроекПодписания = Титул1.ДанныеТ3ПараметрНастроекПодписания;
	КонецЕсли;
	
	// ПоказанияОдометра
	Если Не ЗначениеЗаполнено(ПоказанияОдометра) Тогда
		// Возьмем из предыдущего Т5
		ПоказанияОдометра = КонтурЛогистика_ОбработкаДокументовСервер.ПоследниеПоказанияОдометра(Титул1);
	КонецЕсли;
	
	// ТехРаботник
	Если Не ЗначениеЗаполнено(ТехРаботник) Тогда
		
		// Глобальная
		ТехРаботникПоУмолчанию = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("ПЛ_ТехРаботникПоУмолчанию");
		Если ЗначениеЗаполнено(ТехРаботникПоУмолчанию) Тогда
			ТехРаботник = ТехРаботникПоУмолчанию;
		КонецЕсли;
		
		// Организация
		ТехРаботникПоУмолчанию = КонтурЛогистика_СтдОбщегоНазначения.ЗначениеРеквизитаОбъектаЛок(
			Титул1, "ЛицоОформившееПЛ.ТехРаботникПоУмолчанию");
		Если ЗначениеЗаполнено(ТехРаботникПоУмолчанию) Тогда
			ТехРаботник = ТехРаботникПоУмолчанию;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьУказателиНаПредыдущийТитул(Знач ПредыдущийТитул) Экспорт
	
	Перем ДвоичныеДанныеПодписи, ФайлТитула1;
	
	Если ТипЗнч(ПредыдущийТитул) = Тип("ДокументСсылка.КонтурЛогистика_ПЛ_Титул1_5_02") Тогда 
		ДокТ1 = ПредыдущийТитул;
	Иначе
		ДокТ1 = ПредыдущийТитул.Титул1;
	КонецЕсли;
	
	ФайлТитула1 = Справочники.КонтурЛогистика_ФайлыОбмена.КрайнийФайлДокумента(ДокТ1);
	
	Если Не ЗначениеЗаполнено(ФайлТитула1) Тогда 
		ВызватьИсключение "Не найден файл обмена Титулом 1 Путевого листа - невозможно создать Титул 3: " + ПредыдущийТитул;
	КонецЕсли;
	
	ИдФайлИнфСоб 	= СтрЗаменить(ФайлТитула1.ИмяФайла, ".xml", "");
	ДатФайлИнфСоб 	= ДокТ1.ДатИнфСоб;
	ВрФайлИнфСоб  	= ДокТ1.ВрИнфСоб;
	
	ДвоичныеДанныеПодписи 	= ФайлТитула1.Подпись.Получить();
	ЭПСоб 					= Base64Строка(ДвоичныеДанныеПодписи);

КонецПроцедуры

Процедура ЗаполнитьЧерезНастройкиКонвертации(КонтекстНастройкиКонвертации = Неопределено) Экспорт
	
	Если КонтекстНастройкиКонвертации = Неопределено Тогда
		КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02);
	КонецЕсли;
	
	Если КонтекстНастройкиКонвертации.ЕстьКонвертация Тогда
		КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьДокументТитулПоДокументуУчетнойСистемы(
			ЭтотОбъект, КонтекстНастройкиКонвертации);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ГенерацияXML

Функция СформироватьФайлОбмена(ПараметрыФайлаРеквизиты = Неопределено) Экспорт

	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("МассивФайловОбмена", Новый Массив);
	Результат.Успешно = Истина;
	
	Попытка
	
		Заблокировать();
	
	Исключение
		
		Результат.Успешно = Ложь;
	    Результат.ОписаниеОшибки = "Не удалось заблокировать документ: " + ОписаниеОшибки();
		Возврат Результат;
		
	КонецПопытки;
	
	// Проверка статуса после наложения блокировки на Документ
	РезультатПроверкиСтатуса = КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьТекущийСтатусДокументаДляСозданияФайловОбмена(Ссылка);
	
	Если НЕ РезультатПроверкиСтатуса.Успешно Тогда
		Разблокировать();
		Возврат РезультатПроверкиСтатуса;
	КонецЕсли;
	
	// Выполнить валидацию документа
	РезультатВалидации = Документы.КонтурЛогистика_ПЛ_Титул3_5_02.ПроверитьДокумент(Ссылка);
	
	Если РезультатВалидации.КоличествоОшибок > 0 Тогда
		
		Разблокировать();
		Результат.ОписаниеОшибки = "Ошибки в " + Ссылка + "! Исправьте их для отправки.";
		Результат.Успешно = Ложь;
		Возврат Результат;
		
	КонецЕсли;
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		ДатИнфВыпуск = ТекущаяДатаСеанса();
		ВрИнфВыпуск = ТекущаяДатаСеанса();
		
		РезультатФормированияТекста = СформироватьТекстФайла(ДатИнфВыпуск, ВрИнфВыпуск);
		
		Если РезультатФормированияТекста.Успешно = Ложь Тогда
					
			Результат.Успешно = Ложь;
			Результат.МассивОшибок.Добавить(КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(РезультатФормированияТекста));
			Возврат Результат;
					
		КонецЕсли;
		
		// запишем в справочник
		РезультатСозданияФайла = Справочники.КонтурЛогистика_ФайлыОбмена.СоздатьФайлОбмена(
										РезультатФормированияТекста,
										Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02,
										ПараметрыФайлаРеквизиты,
										Ссылка);
				
		ЗаполнитьЗначенияСвойств(Результат, РезультатСозданияФайла);
		
		Если Результат.Успешно Тогда
			
			РегистрыСведений.КонтурЛогистика_СтатусыТитулов.УстановитьСтатус(Ссылка, 
				Перечисления.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена, , Истина);
			
			Результат.МассивФайловОбмена.Добавить(РезультатСозданияФайла.Файл);
			
		Иначе
			
			ВызватьИсключение КонтурЛогистика_ОбщегоНазначенияКлиентСервер.СформироватьТекстОшибокФункции(Результат);
			
		КонецЕсли;
		
		Записать(); // запишем  ДатИнфТехСост и ВрИнфТехСост
		
		Разблокировать();
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		
		ОтменитьТранзакцию();
		
		Разблокировать();
		Результат.Успешно = Ложь;
		Результат.Массивошибок.Добавить("Ошибка при формировании файла обмена по документу " + Ссылка + ": " + ОписаниеОшибки());
		
		КонтекстМетода = Новый Структура;
		КонтекстМетода.Вставить("ПараметрыФайлаРеквизиты", ПараметрыФайлаРеквизиты);
		КонтекстМетода.Вставить("РезультатСозданияФайла", РезультатСозданияФайла);
		
		КонтурЛогистика_Метрика.ОбработатьОшибкуФормированияТекстаФайла(Ссылка, ИнформацияОбОшибке(), КонтекстМетода);
		
	КонецПопытки;
	
	Возврат Результат;
		
		
КонецФункции 

Функция СформироватьТекстФайла(ДатаФормирования, ВремяФормирования)
	
	НомерТитула = 3;
	Формат = "5.02";
	ТипДокументооборота = "__PL";
	КС = КонтурЛогистика_КонструкторыXDTO;
	
	Результат = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ИнициализироватьСтруктуруРезультатаФункции();
	Результат.Вставить("ТекстФайла", "");
	
	XDTO_Файл = КС.XDTO_ФайлОбмена(НомерТитула, Формат, ТипДокументооборота);
	
	GUID = Строка(Новый УникальныйИдентификатор);
	
	Если ДополнительныеПолучателиФайла.Количество() > 0 Тогда 
		W = 1;
	Иначе
		W = 0;
	КонецЕсли;
	
	КС.ДобавитьДополнительныхПолучателейФайла(XDTO_Файл, ДополнительныеПолучателиФайла); 	
	
	XDTO_Файл.ИдФайл = КС.ИдентификаторФайлаТитулаПЛ_5_02(НомерТитула, 
												Титул1.ЛицоОформившееПЛ,
												Титул1.ОрганизацияМедик,
												GUID,
												W); 
	Результат.Вставить("ИдФайл",		XDTO_Файл.ИдФайл);
												
	ОрганизацияПодписанта = Титул1.ЛицоОформившееПЛ;
	ПодписантСтруктура 	= РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
		ОрганизацияПодписанта, ПользовательПодписант, Неопределено, ЭтотОбъект, ПараметрНастроекПодписания);
	
	XDTO_Подписант 		= КС.XDTO_ПодпИнф(НомерТитула, ТипДокументооборота, Формат, ПодписантСтруктура);
	Если ЗначениеЗаполнено(ПодписантСтруктура.МЧД) И ПодписантСтруктура.СпосПодтПолном = "3" Тогда 
		Результат.Вставить("ИдентификаторМЧД",	ПодписантСтруктура.МЧД);
	КонецЕсли;
	
	XDTO_Файл.Документ	= КС.XDTO_Документ(НомерТитула, ТипДокументооборота, Формат, XDTO_Подписант, ДатаФормирования, ВремяФормирования);
		
	XDTO_ИдИнфСоб 		= КС.XDTO_ПЛ_ИдИнфСоб(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "ИдИнфСоб", XDTO_ИдИнфСоб);
	
	XDTO_СодИнфВыпуск = КС.XDTO_ПЛ_СодИнфВыпуск(НомерТитула, Формат, Ссылка);
	КС.XDTO_Установить(XDTO_Файл.Документ, "СодИнфВыпуск", XDTO_СодИнфВыпуск);
	
	ТекстФайла = КонтурЛогистика_КонструкторыXDTO.ПодготовитьТекстФайлаЛогистика(XDTO_Файл, Формат);
	
	Результат.Вставить("ТекстФайла",ТекстФайла);
	Результат.Вставить("GUID",		GUID);
	
	Результат.Успешно = Истина;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

Процедура ЗаполнитьРеквизитыПоПользователю() Экспорт
	
	Попытка
		
		// Поиск подписанта в настройках подписания по дополнительному параметру.
		Если Не ЗначениеЗаполнено(ПользовательПодписант) И ЗначениеЗаполнено(ПараметрНастроекПодписания) Тогда
			ОрганизацияПодписанта = Титул1.ЛицоОформившееПЛ;
			
			ДанныеПодписанта = РегистрыСведений.КонтурЛогистика_НастройкиПодписания.ВыбратьПодписанта(
				ОрганизацияПодписанта,,, ЭтотОбъект, ПараметрНастроекПодписания);
			
			ПользовательПодписант = ДанныеПодписанта.Пользователь1С;
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(ПользовательПодписант) Тогда 
			ПользовательПодписант = ПараметрыСеанса.ТекущийПользователь;
		КонецЕсли;
				
	Исключение
		
		КонтурЛогистика_Метрика.ОбработатьОшибку("ЗаполнитьРеквизитыПоПользователю", ОписаниеОшибки());

	КонецПопытки;
	
КонецПроцедуры

Процедура УдалитьПустыеСтрокиИзТаблицТоплива()
	
	НаименованияСтолбцов = Новый Структура("Топливо, КоличествоТоплива, КоличествоЧасовРаботыСВключеннымОтопителем, КоличествоЧасовРаботыОборудования",
		Справочники.КонтурЛогистика_ГорючеСмазочныеМатериалы.ПустаяСсылка(), 0, 0, 0);  
		
	ПустыеСтроки = ОстаткиТоплива.НайтиСтроки(НаименованияСтолбцов);  
	Для Каждого Строка Из ПустыеСтроки Цикл  
		ОстаткиТоплива.Удалить(Строка);  
	КонецЦикла;
			
КонецПроцедуры

#КонецОбласти

#КонецЕсли
